UNFCOPY.саУНФУправлениеАссортиментом/src/Enums/саУНФ_СрокиГарантииДубль/саУНФ_СрокиГарантииДубль.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>саУНФ_СрокиГарантииДубль</name>
  <enumValues>
    <name>_6_месяцев</name>
  </enumValues>
  <enumValues>
    <name>_12_месяцев</name>
  </enumValues>
  <enumValues>
    <name>_24_месяца</name>
  </enumValues>
  <enumValues>
    <name>_36_месяцев</name>
  </enumValues>
  <enumValues>
    <name>_48_месяцев</name>
  </enumValues>
</mdclass:Enum>

UNFCOPY.саУНФУправлениеАссортиментом/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bea7f781-5f18-4219-997c-9a767fb284be">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="c714b2ec-44f0-4d97-9f0f-b2917a0fd654">
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="943e74c4-655a-4b9c-b82e-7e5efda13c74">
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c5e9b842-544a-44f2-ab17-9f8914c321c7">
    <name>Вес</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a74696bf-5501-4ca5-88cb-7bfa51d5ba5c">
    <name>Объем</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="684049cc-bea4-46ee-b11f-a71286339275">
    <name>КатегорияНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="29ee8eb2-cd83-4cc1-b40d-4e152378ea5c">
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f21ff321-715f-4a5b-944b-2b848961de15">
    <name>Высота</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b6172ca7-1aac-4ae9-923c-78be3ad52817">
    <name>Длина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="25d2b654-7af2-4ff9-9565-690f90e3301d">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1272ae5d-3d76-41d7-8089-96b9d0e2171d">
    <name>МетодОценки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c14397a9-756b-499c-a0cb-dffb36b39d37">
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4a820996-d36c-4681-a90e-8bddd53206e6">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a4fec3ac-4e1d-4920-a364-ed3b4ea7789d">
    <name>ПроверятьЗаполнениеПартий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2422f318-d2d7-4825-8a73-3422fb7c9b76">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e9ae7ccb-58d3-4b59-908e-f8ae3990cdf5">
    <name>СчетУчетаДоходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4366f2f7-ebc2-41cc-b496-b7c9db977701">
    <name>СчетУчетаЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fecab396-8b88-44fa-b328-6a0a2920dfc4">
    <name>СчетУчетаЗатрат</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="142f8ba7-a38b-4348-9c20-d7d426b19366">
    <name>ТипНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="27d64301-1b5e-4ac9-82b2-fc31566ecc01">
    <name>ВидСтавкиНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9ee9a54f-4c2c-4fe3-b88f-73e8003f88a0">
    <name>Ширина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="10add62f-df6c-44d4-a086-eb92ce5f478b">
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="329a9d17-e027-4bae-8fc7-744dd587d5c4">
    <name>ИспользоватьПартии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="bd8e047b-adf8-40d6-bb50-46e0d3ab9614">
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="00672e15-008c-49f6-89d3-d71ec5d4df3c">
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="515c5b7e-2abb-4a33-9d4b-3bebd39ff5d5">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ada8c4c4-e2e3-494b-9651-3a2ffce216d8">
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

UNFCOPY.саУНФУправлениеАссортиментом/src/CommonForms/ВводГарантийногоТалона/Module.bsl
&НаСервере
Функция ПолучитьГарантийныйСрок(Гарантия)	
        Если Гарантия>36 Тогда
        ГарантийныйСрок = Перечисления.саУНФ_СрокиГарантииДубль._48_месяцев;
        ИначеЕсли Гарантия>24 Тогда
        ГарантийныйСрок = Перечисления.саУНФ_СрокиГарантииДубль._36_месяцев;	
        ИначеЕсли Гарантия>12 Тогда
        ГарантийныйСрок = Перечисления.саУНФ_СрокиГарантииДубль._24_месяца;		
        ИначеЕсли Гарантия>6 Тогда
        ГарантийныйСрок = Перечисления.саУНФ_СрокиГарантииДубль._12_месяцев;	
        Иначе
        ГарантийныйСрок = Перечисления.саУНФ_СрокиГарантииДубль._6_месяцев;	
        КонецЕсли;	
        
        Возврат ГарантийныйСрок;
КонецФункции

&НаСервере
Процедура ТалоныКСозданию(Ссылка)
	НаборЗаписей = РегистрыСведений["саУНФГарантийныеТалоны"].СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Ссылка);
	НаборЗаписей.Записать();
	ТаблицаСерийныйНомер.Очистить();
	
	СписокРеквизитов = "Дата,Номер";
	
	ПараметрыДляВставки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, СписокРеквизитов);
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПрефиксацияОбъектов")  Тогда
		МодульПрефиксацияОбъектовКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ПрефиксацияОбъектовКлиентСервер");
		ПараметрыДляВставки.Номер = МодульПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ПараметрыДляВставки.Номер,Истина,Истина);
	КонецЕсли; 
	    ПараметрыДляВставки.Дата=Формат(ПараметрыДляВставки.Дата,"ДФ=ddMMyyyy;"); 
	    ДлинаСтрокиНомера = СтрДлина(ПараметрыДляВставки.Номер);
	    Если  ДлинаСтрокиНомера>6 Тогда
	    	ПараметрыДляВставки.Номер = Прав(ПараметрыДляВставки.Номер,6);	    
	    ИначеЕсли ДлинаСтрокиНомера <6 Тогда
	    	ПараметрыДляВставки.Номер = Прав(ПараметрыДляВставки.Номер,6);
	    	Для i=1 По 6-ДлинаСтрокиНомера Цикл
	    		ПараметрыДляВставки.Номер ="0"+ПараметрыДляВставки.Номер;
	    	КонецЦикла;
	    КонецЕсли;
	   
	   Лев_Номер =  ПараметрыДляВставки.Номер+"-"+Строка(ПараметрыДляВставки.Дата)+"-";
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ЗаказПокупателяЗапасы.Номенклатура,
	|	ЗаказПокупателяЗапасы.Номенклатура.ГарантийныйСрок КАК ГарантийныйСрок,
	|	ЗаказПокупателяЗапасы.Количество,
	|	ЗаказПокупателяЗапасы.НомерСтроки
	|ПОМЕСТИТЬ ВТ_ЗАКАЗ
	|ИЗ
	|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
	|ГДЕ
	|	ЗаказПокупателяЗапасы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеРеквизитыИСведения.Ссылка
	|ПОМЕСТИТЬ ВТ_ХАРАКТЕРИСТИКА
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Имя = &Имя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ЗАКАЗ.Номенклатура
	|ПОМЕСТИТЬ ВТ_НОМ
	|ИЗ
	|	ВТ_ЗАКАЗ КАК ВТ_ЗАКАЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗАКАЗ.Номенклатура,
	|	ВТ_ЗАКАЗ.ГарантийныйСрок,
	|	ВТ_ЗАКАЗ.Количество,
	|	ВТ_ЗАКАЗ.НомерСтроки
	|ИЗ
	|	ВТ_ЗАКАЗ КАК ВТ_ЗАКАЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НОМ.Номенклатура,
	|	НоменклатураДополнительныеРеквизиты.Свойство,
	|	НоменклатураДополнительныеРеквизиты.Значение
	|ИЗ
	|   Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НОМ КАК ВТ_НОМ
	|       ПО НоменклатураДополнительныеРеквизиты.Ссылка = ВТ_НОМ.Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ХАРАКТЕРИСТИКА КАК ВТ_ХАРАКТЕРИСТИКА		 	  
	|		ПО НоменклатураДополнительныеРеквизиты.Свойство = ВТ_ХАРАКТЕРИСТИКА.Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Имя", "Гарантия_0320171166cd41768d71c9c4afd0320c");

	РезультатЗапросаПакет = Запрос.ВыполнитьПакет();
    РезультатЗапроса = РезультатЗапросаПакет[3];
    ТаблицаГарантии  = РезультатЗапросаПакет[4].Выгрузить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НомСтр = СокрЛП(Строка(ВыборкаДетальныеЗаписи.НомерСтроки));
		Если СтрДлина(НомСтр) = 1 Тогда
			НомСтр="0" + НомСтр;
		КонецЕсли;
		ГарантийныйСрок = Перечисления.саУНФ_СрокиГарантииДубль._6_месяцев;
		Отбор = Новый Структура("Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
		Если ТаблицаГарантии.Количество()>0 Тогда
			 МассивГарантии = ТаблицаГарантии.НайтиСтроки(Отбор);
			 Если МассивГарантии.Количество()>0 Тогда
			 	 Гарантия = ЛЕВ(МассивГарантии[0].Значение.Наименование,2);
			 	 Гарантия = СтрЗаменить(Гарантия,"." ,"" );
			 	 Гарантия = СтрЗаменить(Гарантия,"мес" ,"" );
			 	 Гарантия = СокрЛП(Гарантия);
			 	 Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Гарантия) Тогда
					Гарантия = Число(Гарантия);
					ГарантийныйСрок = ПолучитьГарантийныйСрок(Гарантия);
				КонецЕсли;	
			 КонецЕсли;
		КонецЕсли;

        	
		
		Для i = 1 По ВыборкаДетальныеЗаписи.Количество Цикл
			НоваяСтрока = ТаблицаСерийныйНомер.Добавить();
			НомКол=СокрЛП(Строка(i));
			НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			НоваяСтрока.Номер = Лев_Номер +НомСтр+"/"+НомКол;
			НоваяСтрока.СрокГарантии = ГарантийныйСрок;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ВидимостьЭлементов()
	Элементы.ТаблицаСерийныйНомерАвтомобиль.Видимость = ИнфоПоАвтомобилю;
	Элементы.ИнфоДвигатель.Видимость = ИнфоПоАвтомобилю;
	Элементы.ИнфоПоАвто.Видимость = ИнфоПоАвтомобилю;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Параметры.Свойство("Документ") Тогда
		Отказ = Истина;
	КонецЕсли;
	ВидимостьЭлементов();
	Документ = Параметры.Документ;
	ТалоныКСозданию(Параметры.Документ);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнфоПоАвтомобилюПриИзменении(Элемент)
	ВидимостьЭлементов();
КонецПроцедуры


&НаКлиенте
Процедура СоздатьГарантийныеТалоны(Команда)
	СоздатьГарантийныеТалоныНаСервере();
	Закрыть(Истина);
КонецПроцедуры

&НаСервере
Функция ПроверкаЗаполнения()
	Отказ = Ложь;
	Для Каждого СтрТаб Из ТаблицаСерийныйНомер Цикл
		Если Не ЗначениеЗаполнено(СтрТаб.СерийныйНомер) Тогда
			Индекс = ТаблицаСерийныйНомер.Индекс(СтрТаб)+1;
			ТекстСообщения = СтрШаблон("В строке %1 не заполнен серийный номер",Индекс);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;
		КонецЕсли;	
	КонецЦикла;
	Возврат Отказ;
КонецФункции

&НаСервере
Процедура СоздатьГарантийныеТалоныНаСервере()
	Если ПроверкаЗаполнения() Тогда
		Возврат;
	КонецЕсли;
	
	
	НаборЗаписей = РегистрыСведений["саУНФГарантийныеТалоны"].СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Документ);
	Для Каждого СтрТаб Из ТаблицаСерийныйНомер Цикл
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, СтрТаб);
		Запись.Пользователь = Пользователи.ТекущийПользователь();
		Запись.Документ = Документ;
		Запись.Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "Контрагент");
		Запись.Количество = 1;
		Индекс = Перечисления.саУНФ_СрокиГарантииДубль.Индекс(СтрТаб.СрокГарантии);
		Запись.СрокГарантии = Перечисления["саУНФ_СрокГарантии"].Получить(Индекс);
	КонецЦикла;
	НаборЗаписей.Записать();
КонецПроцедуры
